@extends('layouts.main')

<!-- Start Featured Slider -->
@section('content')

<div style="margin-top:90px ; " >
        <div class="w3-sidebar w3-bar-block w3-black w3-card" style="width:130px">           
            <button class="w3-bar-item w3-button tablink" onclick="openLink(event, 'reading')">เทคนิคการอ่านจับใจความ</button>
            <button class="w3-bar-item w3-button tablink" onclick="openLink(event, 'writing')">เทคนิคการเขียนแผนภาพ</button>             
            <button class="w3-bar-item w3-button tablink" onclick="location.href='{{ url('/learn') }}'"> <span class="glyphicon  glyphicon glyphicon-arrow-left " aria-hidden="true"></span>   ย้อนกลับ</button>
        </div>        
        <div id="reading" class="w3-container city w3-animate-zoom" style="margin-left:250px; margin-right:150px; margin-bottom:500px; display:block">
            <h1><br/></h1>
            <h1>เทคนิคการอ่านจับใจความ</h1><br/>
            <p>
            <h5><b>1. เทคนิคการใช้วงกลมล้อมรอบหรือไฮไลท์ “คำสำคัญ” ที่เชื่อมประโยค</b></h5>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คำสำคัญ นับว่าเป็นหัวใจสำคัญของ GAT เชื่อมโยง คำสำคัญเป็นตัวเชื่อม ระหว่างข้อความหรือประโยคเพื่อให้เกิดความเชื่อมโยง เมื่อผู้ทำข้อสอบ พบในบทความให้วงกลมล้อมรอบคำสำคัญเหล่านั้นเอาไว้เพื่อนำมาวิเคราะห์รูปแบบการเชื่อมโยง ว่าอยู่ในลักษณะใด 
            แล้วจึงสามารถเขียนแผนภาพอธิบายความสัมพันธ์ของข้อความได้อย่างถูกต้อง  
            <h5><b>2. เทคนิคการขีดเส้นใต้ข้อความหรือประโยคที่กล่าวซ้ำในบทความ</b></h5>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ข้อความหรือประโยคที่กล่าวซ้ำกับข้อความหรือประโยคที่เป็นตัวหนานั้น โดยส่วนใหญ่ จะกล่าวซ้ำ เพื่อเชื่อมโยงให้เห็นความสัมพันธ์ระหว่างข้อความหรือประโยคในลักษณะสาเหตุ ผลลัพธ์ ส่วนประกอบ ป้องกัน ลด ยับยั้ง เป็นการพูดย้ำถึงข้อความที่กำหนดให้โดยผู้ทำข้อสอบ จะต้องสังเกตจากการอ่านจับใจความ 
            และเมื่อพบข้อความหรือประโยคที่กล่าวซ้ำกับข้อความหรือ ประโยคที่เป็นตัวหนาที่กำหนดให้ผู้ทำข้อสอบควรขีดเส้นใต้ข้อความหรือประโยคนั้นทันที  
            </p>       
        </div>
        <div id="writing" class="w3-container city w3-animate-zoom" style="display:none; margin-left:250px; margin-right:150px; margin-bottom:500px;">
            <h1><br/></h1>
            <h1>เทคนิคการเขียนแผนภาพ</h1><br/> 
            <p>
            <h5><b>1. แผนภาพแบบเรียงลำดับเวลา</b></h5>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;แผนภาพแบบเรียงลำดับเวลา คือ การนำข้อความหรือประโยคใน GAT เชื่อมโยง มาเรียงลำดับใหม่ซึ่งจะสัมพันธ์กับลำดับเวลา โดยจะกำหนดสัดส่วนของแผนภาพต่อหน้าไว้ 3 ส่วน ได้แก่ ส่วนของสาเหตุส่วนของผลกระทบ ผลลัพธ์และส่วนของแนวทางป้องกัน ลด ยับยั้ง
            <br/><br/><img src="{{ URL::asset('theory_images/T_1.png') }}" alt="T_1" class="center"><br/><br/>
            วิธีการร่างแผนภาพ<br/>
            1.1 อ่านบทความ จากนั้นให้วงกลมล้อมรอบหรือไฮไลท์คำสำคัญที่เชื่อมประโยค ระหว่างสาเหตุผลลัพธ์ส่วนประกอบป้องกันลดยับยั้งตามวิธีการที่ได้กล่าวไว้แล้วและ ขีดเส้นใต้ข้อความหรือประโยคที่ซ้ำกับข้อความหรือประโยคตัวหนาที่ สทศ. กำหนด<br/>
            1.2 จัดข้อความที่ สทศ. กำหนดให้เป็นกลุ่มๆ โดยแยกไว้ดังนี้กลุ่มสาเหตุ กลุ่มผลลัพธ์กลุ่มส่วนประกอบ และกลุ่มป้องกัน ลด ยับยั้ง <br/>
            1.3 นำข้อความที่แบ่งกลุ่ม มาเขียนเป็นแผนภาพแบบเรียงลำดับเวลา โดยดู ต้นแบบจากตัวอย่างและนำไปประยุกต์<br/><br/>
  
            <h5><b>2. แผนภาพแบบอิสระ</b></h5>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;แผนภาพแบบอิสระ คือ แผนภาพที่ไม่เป็นไปตามลำดับเวลา อาจร่างข้อความที่ ขึ้นต้นด้วยผลลัพธ์ส่วนประกอบ หรือป้องกัน ลด ยับยั้งก่อนก็ได้ 
            <br/><br/><img src="{{ URL::asset('theory_images/T_2.png') }}" alt="T_2" class="center"><br/><br/>
            วิธีการร่างแผนภาพ<br/>
            2.1 อ่านบทความแล้ววงกลมล้อมรอบหรือไฮไลท์คำสำคัญและขีดเส้นใต้ข้อความหรือ ประโยคที่กล่าวซ้ำกับข้อความหรือประโยคตัวหนาที่สทศ. กำหนด เพื่อเชื่อมโยงหาความสัมพันธ์ จากคำสำคัญและการกล่าวซ้ำ<br/>
            2.2 เขียนข้อความที่1 หรือตัวเลขกำกับข้อความตามบทความ แล้วโยงเส้นตามคำสำคัญ ที่ปรากฏ เช่น ถ้าคำสำคัญระบุว่าเป็นส่วนประกอบ ให้เขียนโยงหัวกลมๆ ไปยังหัวเรื่องใหญ่ ของสิ่งนั้นจากนั้นค่อยทำข้อความถัดมา แล้วโยงเส้นตามคำสำคัญเชื่อมที่ระบุเช่นสาเหตุผลลัพธ์ ส่วนประกอบ ป้องกัน ลด ยับยั้ง ไปเรื่อยๆ ตามลำดับในบทความจนจบ<br/>
            2.3 เวลาร่างแผนภาพให้พยายามเว้นที่ไว้และเขียนข้อความหรือตัวเลขกำกับข้อความที่สทศ. กำหนดแบบกระจายตัว และกลุ่มที่เป็นคำประเภทเดียวกันให้อยู่ใกล้กัน เช่น ข้อความที่เกี่ยวข้อง กับสาเหตุผลลัพธ์ข้อความที่เกี่ยวข้องกับส่วนประกอบข้อความที่เกี่ยวข้องกับป้องกันลด ยับยั้ง<br/>
 
            </p>          
        </div> 
    </div>

@endsection
	<!-- End main content -->	

    <script>
        function openLink(evt, animName) {
        var i, x, tablinks;
        x = document.getElementsByClassName("city");
        for (i = 0; i < x.length; i++) {
            x[i].style.display = "none";
        }
        tablinks = document.getElementsByClassName("tablink");
        for (i = 0; i < x.length; i++) {
            tablinks[i].className = tablinks[i].className.replace(" w3-red", "");
        }
        document.getElementById(animName).style.display = "block";
        evt.currentTarget.className += " w3-red";
        }
    </script>
